
#Область СлужебныеПроцедурыИФункции

Функция pingПроверитьСоединение(Запрос)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 18 октября 2024 г.	
	Текст = СтрШаблон("%1. %2", Пользователи.ТекущийПользователь(), ТекущаяДата());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(Текст);
		
	Возврат Ответ;
// Конец вставки от 18 октября 2024 г.
КонецФункции

Функция deliveryПолучитьДоставки(Запрос)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства
	Ответ = Новый HTTPСервисОтвет(200);
	
	//Найдем существующий или создадим новый план обмена для конкретного устройства:
	
	ИДМобильногоУстройства = Запрос.Заголовки.Получить("x_MobileID");
	
	Узел = ПланыОбмена.ОбновлениеСпискаДоставок.НайтиПоКоду(ИДМобильногоУстройства);
	
		Если Не ЗначениеЗаполнено(Узел) Тогда
			
			НовыйУзел = ПланыОбмена.ОбновлениеСпискаДоставок.СоздатьУзел();
			НовыйУзел.Код = ИДМобильногоУстройства;
			НовыйУзел.Наименование = ИДМобильногоУстройства;
			НовыйУзел.Записать();
			
			Узел = НовыйУзел.Ссылка;
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказПокупателя.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				|ГДЕ
				|	ЗаказПокупателя.Ответственный = &ТекущийПользователь";
			
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			МассивДляРегистрации = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, МассивДляРегистрации);
		
		КонецЕсли;
		
		//Найдем объекты для обмена: 
		//Можно выбрать изменения любого другого документа и добавить в МассивДляОтправки и МассивДляОтменыРегистрации
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПокупателяИзменения.Ссылка КАК Ссылка,
			|	ЗаказПокупателяИзменения.Ссылка.Номер КАК Номер,
			|	ЗаказПокупателяИзменения.Ссылка.Дата КАК Дата,
			|	ЗаказПокупателяИзменения.Ссылка.Контрагент КАК Контрагент,
			|	ЗаказПокупателяИзменения.Ссылка.Комментарий КАК Комментарий
			|ИЗ
			|	Документ.ЗаказПокупателя.Изменения КАК ЗаказПокупателяИзменения
			|ГДЕ
			|	ЗаказПокупателяИзменения.Узел = &Узел";
		
		Запрос.УстановитьПараметр("Узел", Узел);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		//Соберем пакет для обмена:
		
		МассивДляОтправки = Новый Массив;
		МассивДляОтменыРегистрации = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Заказ = Новый Структура;
			Заказ.Вставить("Ссылка", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			Заказ.Вставить("Номер", Выборка.Номер);
			Заказ.Вставить("Дата", Строка(Формат(Выборка.Дата, "ДЛФ=DDT")));
			Заказ.Вставить("Контрагент", Строка(Выборка.Контрагент));
			Заказ.Вставить("Комментарий", Выборка.Комментарий);
			
			МассивДляОтправки.Добавить(Заказ);
			МассивДляОтменыРегистрации.Добавить(Выборка.Ссылка); //В данном случе не обновляется список документов
			
		КонецЦикла;
		
		//ТелоОтвета = ЗаписатьЗначениеJSON(МассивДляОтправки); //Метод работает начиная с версии 8.3.23
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, МассивДляОтправки);
		ТелоОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		
		//Отменим регистрацию:
		Если МассивДляОтменыРегистрации.Количество() > 0 Тогда
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивДляОтменыРегистрации);
			
		КонецЕсли;
		
	Возврат Ответ; 
// Конец Володин А.А. 23 октября 2024 г.
КонецФункции

#КонецОбласти
