
#Область СлужебныеПроцедурыИФункции

Функция pingПроверитьСоединение(Запрос)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 18 октября 2024 г.	
	Текст = СтрШаблон("%1. %2", Пользователи.ТекущийПользователь(), ТекущаяДата());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(Текст);
		
	Возврат Ответ;
// Конец вставки от 18 октября 2024 г.
КонецФункции

Функция deliveryПолучитьДоставки(Запрос)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства
	Ответ = Новый HTTPСервисОтвет(200);
	
	//Найдем существующий или создадим новый план обмена для конкретного устройства:
	
	ИДМобильногоУстройства = Запрос.Заголовки.Получить("x_MobileID");
	
	Узел = ПланыОбмена.ОбновлениеСпискаДоставок.НайтиПоКоду(ИДМобильногоУстройства);
	
		Если Не ЗначениеЗаполнено(Узел) Тогда
			
			НовыйУзел = ПланыОбмена.ОбновлениеСпискаДоставок.СоздатьУзел();
			НовыйУзел.Код = ИДМобильногоУстройства;
			НовыйУзел.Наименование = ИДМобильногоУстройства;
			НовыйУзел.Записать();
			
			Узел = НовыйУзел.Ссылка;
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказПокупателя.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				|ГДЕ
				|	ЗаказПокупателя.Ответственный = &ТекущийПользователь";
			
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			МассивДляРегистрации = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, МассивДляРегистрации);
		
		КонецЕсли;
		
	//Найдем объекты для обмена:
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Д_ДоставкаИзменения.Ссылка КАК Ссылка,
			|	Д_ДоставкаИзменения.Ссылка.Номер КАК Номер,
			|	Д_ДоставкаИзменения.Ссылка.Дата КАК Дата,
			|	Д_ДоставкаИзменения.Ссылка.Организация КАК Организация,
			|	Д_ДоставкаИзменения.Ссылка.Контрагент КАК Контрагент,
			|	Д_ДоставкаИзменения.Ссылка.Договор КАК Договор,
			|	Д_ДоставкаИзменения.Ссылка.АдресДоставки КАК АдресДоставки,
			|	Д_ДоставкаИзменения.Ссылка.Основание КАК Основание,
			|	Д_ДоставкаИзменения.Ссылка.Ответственный КАК Ответственный,
			|	Д_ДоставкаИзменения.Ссылка.Комментарий КАК Комментарий
			|ИЗ
			|	Документ.Д_Доставка.Изменения КАК Д_ДоставкаИзменения
			|ГДЕ
			|	Д_ДоставкаИзменения.Узел = &Узел";
		
		Запрос.УстановитьПараметр("Узел", Узел);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		//Соберем пакет для обмена:
		
		МассивДляОтправки = Новый Массив;
		МассивДляОтменыРегистрации = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			ДокументДоставки = Новый Структура;
			
			ДокументДоставки.Вставить("Ссылка", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			ДокументДоставки.Вставить("Номер", Выборка.Номер);
			ДокументДоставки.Вставить("Дата", Выборка.Дата);
			ДокументДоставки.Вставить("Организация", Строка(Выборка.Организация));
			ДокументДоставки.Вставить("Контрагент", Строка(Выборка.Контрагент));
			ДокументДоставки.Вставить("Договор", Строка(Выборка.Договор));
			ДокументДоставки.Вставить("АдресДоставки", Выборка.АдресДоставки);
			ДокументДоставки.Вставить("Основание", Строка(Выборка.Основание));
			ДокументДоставки.Вставить("Ответственный", Строка(Выборка.Ответственный));
			ДокументДоставки.Вставить("Комментарий", Выборка.Комментарий);
			
			МассивДляОтправки.Добавить(ДокументДоставки);
			МассивДляОтменыРегистрации.Добавить(Выборка.Ссылка);
			
		КонецЦикла;
		
		ТелоОтвета = ЗаписатьЗначениеJSON(МассивДляОтправки);
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		
		//Отменим регистрацию:
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, МассивДляОтменыРегистрации);
		
	Возврат Ответ; 
// Конец Володин А.А. 23 октября 2024 г.	
КонецФункции

#КонецОбласти
