
#Область СлужебныеПроцедурыИФункции

Функция pingПроверитьСоединение(Запрос)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 18 октября 2024 г.	
	Текст = СтрШаблон("%1. %2", Пользователи.ТекущийПользователь(), ТекущаяДата());
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(Текст);
		
	Возврат Ответ;
// Конец вставки от 18 октября 2024 г.
КонецФункции

Функция deliveryПолучитьДоставки(Запрос)
// Начало Володин А.А. 23 октября 2024 г.
// Задача 1 ДЗ Обмен с центральной базой и использование возможностей мобильного устройства
	Ответ = Новый HTTPСервисОтвет(200);
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказПокупателя.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
				|ГДЕ
				|	ЗаказПокупателя.Ответственный = &ТекущийПользователь";
			
			Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.ТекущийПользователь());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ТелоОтвета = РезультатЗапроса.Выгрузить().Количество();
			
		//ТелоОтвета = ЗаписатьЗначениеJSON(МассивДляОтправки); //Метод работает начиная с версии 8.3.23
		//ЗаписьJSON = Новый ЗаписьJSON;
		//ЗаписьJSON.УстановитьСтроку();
		//ЗаписатьJSON(ЗаписьJSON, МассивДляОтправки);
		//ТелоОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
		
	Возврат Ответ; 
// Конец Володин А.А. 23 октября 2024 г.
КонецФункции

#КонецОбласти
