
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
// Володин А.А. 
// Задача 2 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
