
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
// Володин А.А. 
// Задача 1 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Организация,
			|	РеализацияТоваровУслуг.Контрагент,
			|	РеализацияТоваровУслуг.Договор,
			|	РеализацияТоваровУслуг.Основание,
			|	РеализацияТоваровУслуг.Товары.(
			|		Номенклатура,
			|		Количество)
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Заполнение шапки
			Организация = ВыборкаДетальныеЗаписи.Организация;
			Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			Договор = ВыборкаДетальныеЗаписи.Договор;
			Основание = ДанныеЗаполнения;
			//Заполнение табличной части
			ВыборкаТаблицыТовары = ВыборкаДетальныеЗаписи.Товары.Выбрать();
			Пока ВыборкаТаблицыТовары.Следующий() Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаТаблицыТовары.Номенклатура;
				НоваяСтрока.Количество = ВыборкаТаблицыТовары.Количество;
			КонецЦикла;
		
		КонецЦикла;
	
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
//Начало Володин А.А. 27 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Если ОбменДанными.Загрузка Тогда
	     
	     Возврат;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Д_ОбменСМобильнымУстройством.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.Д_ОбменСМобильнымУстройством КАК Д_ОбменСМобильнымУстройством
		|ГДЕ
		|	Д_ОбменСМобильнымУстройством.Пользователь = &Пользователь
		|	И НЕ Д_ОбменСМобильнымУстройством.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Пользователь", Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
//Конец Володин А.А. 27 октября 2024 г.
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//Начало Володин А.А. 29 октября 2024 г.
//Итоговая работа по модулю Мобильная разработка в 1С
	Если Статус = Перечисления.Д_СтатусыДоставок.ОтклонёнКлиентом Или Статус = Перечисления.Д_СтатусыДоставок.ОтклонёнКурьером Тогда
		
		ПроверяемыеРеквизиты.Добавить("Комментарий");
		Сообщить("Укажите причину отклонения!");
		
	КонецЕсли;
//Конец Володин А.А. 29 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
