
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
// Володин А.А. 
// Задача 1 ДЗ Базовые подсистемы 
// 15 октября 2024 г.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Организация,
			|	РеализацияТоваровУслуг.Контрагент,
			|	РеализацияТоваровУслуг.Договор,
			|	РеализацияТоваровУслуг.Основание,
			|	РеализацияТоваровУслуг.Товары.(
			|		Номенклатура,
			|		Количество)
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Заполнение шапки
			Организация = ВыборкаДетальныеЗаписи.Организация;
			Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			Договор = ВыборкаДетальныеЗаписи.Договор;
			Основание = ВыборкаДетальныеЗаписи.Основание;
			//Заполнение табличной части
			ВыборкаТаблицыТовары = ВыборкаДетальныеЗаписи.Товары.Выбрать();
			Пока ВыборкаТаблицыТовары.Следующий() Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаТаблицыТовары.Номенклатура;
				НоваяСтрока.Количество = ВыборкаТаблицыТовары.Количество;
			КонецЦикла;
		
		КонецЦикла;
	
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
// Конец вставки от 15 октября 2024 г.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
